{
  "format": "graph-model",
  "generatedBy": "2.17.0",
  "convertedBy": "TensorFlow.js Converter v4.21.0",
  "signature": { "outputs": { "Identity:0": { "name": "Identity:0" } } },
  "modelTopology": {
    "node": [
      {
        "name": "ConstantFolding/PartitionedCall/model_37/tf.math.divide/truediv_recip",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "1" }]
              }
            }
          }
        }
      },
      {
        "name": "29654",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          }
        }
      },
      {
        "name": "29646",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29648",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_22/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "29656",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29640",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29642",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_19/StridedSlice/strides",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.reshape_20/Reshape/shape",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.compat.v1.transpose_46/transpose/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.compat.v1.transpose_47/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "29644",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.compat.v1.transpose_52/transpose/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.reshape_23/Reshape/shape",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "29650",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29652",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_21/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_27/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.math.multiply_350/Mul/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29580",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29590",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29604",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29614",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29626",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29636",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29540",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "1" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29542",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29548",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "80" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29550",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29564",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "80" },
                  { "size": "1" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29570",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29592",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29594",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29624",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29638",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_16/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.compat.v1.transpose_29/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.reshape_11/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "29578",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29588",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29602",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29612",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29622",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29632",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29554",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29558",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29562",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "80" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29568",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          }
        }
      },
      {
        "name": "29576",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "80" },
                  { "size": "1" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29586",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29600",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29610",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29620",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29634",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_19/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.compat.v1.transpose_34/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.reshape_14/Reshape/shape",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "29574",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "256" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29584",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29598",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29608",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29618",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29628",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29536",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "29538",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_17/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29508",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29510",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29512",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29514",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29516",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29518",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29520",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29522",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29524",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29528",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29486",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29488",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_15/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "29456",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29458",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_13/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.image.resize_1/resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_11/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "29440",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "256" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29442",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29444",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29446",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_14/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "29448",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29450",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        }
      },
      {
        "name": "29452",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29454",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_12/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "29460",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29462",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29464",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "29466",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29468",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "29432",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "29434",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_11/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.image.resize/resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_9/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "29416",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29418",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29420",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "29422",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_12/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "29424",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29426",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        }
      },
      {
        "name": "29428",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29430",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_10/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "29436",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29438",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_13/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "29470",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29472",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29474",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "29476",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_16/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "29478",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "32" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29480",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29482",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29484",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.concat_17/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "29490",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "29492",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29494",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "29496",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29498",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29410",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "29402",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "29398",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_8/StridedSlice/begin",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_8/StridedSlice/end",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_37/tf.strided_slice_8/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
