{
  "format": "graph-model",
  "generatedBy": "2.18.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": { "outputs": { "Identity:0": { "name": "Identity:0" } } },
  "modelTopology": {
    "node": [
      {
        "name": "ConstantFolding/model_144/tf.math.divide/truediv_recip",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_9/ones_like/tensor",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_9/StridedSlice/end",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_9/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.math.add_193/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/143734",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_6/StridedSlice/begin",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_6/StridedSlice/end",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_6/StridedSlice/strides",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.reshape_107/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.transpose_367/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.transpose_368/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_877/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.transpose_373/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.reshape_110/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_8/ones_like/tensor",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_8/StridedSlice/end",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_8/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.concat_33/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.math.multiply_428/Mul/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "8400" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_836/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_136/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_837/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_138/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_840/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_141/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.nn.depthwise_conv2d/depthwise/filter_in",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_137/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_838/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_139/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.nn.depthwise_conv2d_3/depthwise/filter_in",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "80" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_144/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_845/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_149/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_849/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_153/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.concat_21/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.transpose_319/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.reshape_98/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_856/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_164/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_857/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_166/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_860/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_169/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.nn.depthwise_conv2d_4/depthwise/filter_in",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_165/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_858/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_167/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.nn.depthwise_conv2d_5/depthwise/filter_in",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "80" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_170/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_863/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_173/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_865/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "80" },
                  { "size": "80" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_175/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "80" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.concat_25/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.transpose_342/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.reshape_101/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_871/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "256" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_185/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_872/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_187/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_874/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_189/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_4/ones_like/tensor",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_4/StridedSlice/end",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.strided_slice_4/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_861/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_171/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_864/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_174/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_866/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_176/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_867/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_179/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_868/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_180/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_841/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_145/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_846/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_150/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_850/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_154/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_851/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_157/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_852/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_158/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_827/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_123/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_829/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_125/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_830/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_126/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_831/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_129/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_832/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_130/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.image.resize_1/resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.concat_15/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_826/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "256" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_122/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_828/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_124/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.concat_16/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_833/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_133/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.concat_17/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_834/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_134/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.compat.v1.pad_5/Pad/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_835/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_135/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_818/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_110/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_820/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_112/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_821/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_113/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_822/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_116/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_823/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_117/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.image.resize/resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.concat_12/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "model_144/tf.nn.convolution_817/convolution/filter",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_144/tf.math.add_109/Add/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
